Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: །ཡུལ་གྱི་མི་ཐམས་ཅད་དང་བཙུན་མོའི་འཁོར་དང་ནང་མི་ཐམས་ཅད་དང་། གྲོགས་པོ་ཐམས་ཅད་ཀྱང་དེའི་རྗེས་སུ་བསླབས་ཏེ་རབ་ཏུ་བྱུང་ངོ་།
en: All people in the country, his retinue of ladies of the court, all his family members, and all his companions followed his example and became renunciants.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་འདི་སྙམ་དུ་སེམས་ཏེ་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱི་རྗེས་སུ་སློབ་ཅིང་ཡུལ་གྱི་མི་ཐམས་ཅད་རབ་ཏུ་བྱུང་གིས་བདག་ཅག་གིས་དེ་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱས་ན་དཀོན་མཆོག་གསུམ་ལ་རིམ་གྲོ་བྱས་པར་འགྱུར་རོ་སྙམ་མོ།
en: At this point, Rāṣṭrapāla, the gods of the Śuddhāvāsa realm thought, ‘People of all countries have become renunciants following Puṇyaraśmi’s example. Therefore, if we honor and serve them, we will honor the Three Jewels.’

source: །དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་དམ་པའི་ཆོས་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རྩ་བཞིའི་བར་དུ་གནས་ཏེ་དགེ་སློང་བསོད་ནམས་ཀྱི་འོད་ཟེར་གྱིས་ཐམས་ཅད་ཡོངས་སུ་བཟུང་ངོ་།
en: “Following the parinirvāṇa of the tathāgata, the excellent Dharma had remained for six hundred forty million years, and it was preserved in its entirety by the monk Puṇyaraśmi.

source: །ཚུལ་འདི་ལྟ་བུས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བཞི་ལ་རྣམ་པ་དེ་ལྟ་བུས་མཆོད་པ་བྱས་སོ།
en: In such a way, he worshiped myriad buddhas.

source: །ཡུལ་འཁོར་སྐྱོང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འོད་ཟེར་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་ཁྱོད་དེ་ལྟར་དོགས་ཤིང་ཐེ་ཚོམ་ཟ་འམ་ཡིད་གཉིས་སུ་གྱུར་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: “Now, Rāṣṭrapāla, in case you hesitate, harbor any doubts, or have a second thought, wondering whether at that time King Arciṣmān was someone else, you should not do so.

source: དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་འོད་ཟེར་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Because at that time, the Tathāgata Amitāyus was indeed King Arciṣmān.

source: །ཡུལ་འཁོར་སྐྱོང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དེ་ལྟར་དོགས་ཤིང་ཐེ་ཚོམ་ཟ་འམ་ཡིད་གཉིས་སུ་གྱུར་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: Now, Rāṣṭrapāla, in case you hesitate, harbor any doubts, or have a second thought, wondering whether at that time young prince Puṇyaraśmi was someone else, you should not do so.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་ཞེས་བྱ་བར་གྱུར་ཏོ། །གྲོང་ཁྱེར་གྱི་ལྷ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུག་པར་གྱུར་ཏོ།
en: Because at that time, I was young prince Puṇyaraśmi, and the main deity of the city was the Tathāgata Akṣobhya.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་ལྷག་པའི་བསམ་པས་བསྒྲུབ་པ་དང་སྡུག་པ་དང་མི་སྡུག་པ་ཡོངས་སུ་སྤངས་པ་དང་། བག་ཡོད་པའི་སྤྱོད་པས་རྒྱལ་བུ་གཞོན་ནུ་བསོད་ནམས་ཀྱི་འོད་ཟེར་དེའི་རྗེས་སུ་བསླབ་པར་བྱའོ། །ངས་བྱ་དཀའ་བ་མངོན་པར་འདུ་བྱ་བ་དེ་ལྟ་བུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ།
en: Therefore, Rāṣṭrapāla, a bodhisattva mahāsattva who desires to be perfectly awakened to unsurpassable, completely perfect enlightenment should follow the example of young prince Puṇyaraśmi by accomplishing the highest intent, by abandoning pleasant and unpleasant things, and by conscientious conduct. “Through the accomplishment of such difficult tasks, I attained unsurpassable, completely perfect enlightenment. Yet there are those without diligence; those who strive after gain, honor, and glory;

source: །དེ་ལྟ་བས་ན་དེ་དག་མི་བརྩོན་པ་དང་རྙེད་པ་དང་བཀུར་སྟི་དང་ཚིགས་སུ་བཅད་པ་ལྷུར་ལེན་པ་དང་། ཤེས་ཀྱི་ཁེ་ལ་ཆགས་པ་དང་ང་རྒྱལ་གྱིས་བཅོམ་པ་དང་འདོད་པའི་རྒྱུས་ཉོན་མོངས་ཤིང་ཤ་ཐང་བ་དང་འདོད་པའི་རྒྱུས་བསྟན་པ་ལས་རིང་དུ་གྱུར་པ་དང་རབ་ཏུ་བྱུང་བ་དོན་མེད་པ་དང་། དགེ་སྦྱོང་སུན་པར་བྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྨུ་རྒོད་དང་ལུས་དང་ངག་དང་སེམས་མི་དྲང་བ་དང་ལྟས་ལྟ་བ་དང་ཁས་འཆེ་བ་ནོར་བ་དང་རང་གི་དམ་བཅས་པ་ལས་ཉམས་པ་དང་གོས་དང་ཟས་དང་མལ་ཆ་དང་ན་བའི་ཆེད་ཀྱི་སྨན་དང་ཡོ་བྱད་ཀྱི་མཚན་མ་ལ་ཆགས་པ་དང་། ངོ་ཚ་མི་ཤེས་པ་དང་ཁྲེལ་མེད་པ་དང་ཆོ་ག་ཉམས་པ་དང་དམ་པའི་ཆོས་མ་ཡིན་པ་ལ་འཇུག་པ་དང་སྤྱོད་ཡུལ་དང་བྲལ་བ་དང་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལས་རིང་དུ་གྱུར་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་བྲལ་བ་དང་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་དང་བྲལ་བར་གྱུར་ཏོ།
en: those who are attached to public reputation; those who are overpowered by pride, afflicted, distressed, and far from the teachings due to their desires; those who became renunciants for no good reason; those who are weary of asceticism; those who are unruly bodhisattvas; those who are dishonest in body, speech, and mind; those who are fortune tellers; those who offer false promises; those who do not keep their word; those who are attached to the trappings of clothing, food, bedding, medicine for the sick, and personal belongings; those who have no sense of shame or modesty; those who display bad behavior; those who are devoted to something other than the genuine Dharma; those who are without the experiential sphere of spiritual practice; those who are far from the experiential sphere of the buddhas; those who are outside the vehicle of the Buddha; and those who do not possess the aspiration to perfect enlightenment.

source: །ཡུལ་འཁོར་སྐྱོང་དེ་ལྟ་བས་ན་རྣམ་པ་འདི་ལྟ་བུའི་ཆོས་འདི་ཐོས་ནས་སྡིག་པའི་བཤེས་གཉེན་རིགས་པ་མེད་པ་རྙེད་པ་དོན་དུ་གཉེར་བ་དང་མི་བསྟེན་པར་ཤེས་པར་བྱའོ།
en: Having heard these teachings, Rāṣṭrapāla, you should know that such people are nefarious friends, unreasonable, motivated only by gain, and not to be associated with.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: Then, the Bhagavān uttered the following verses:

source: །སྟོབས་བཅུ་མངའ་བའི་སྤྱོད་པ་དཔག་མེད་ན།
en: “While engaged in the unfathomable practice of acquiring the ten strengths,

source: །སྙིང་ནི་ཐོབ་དང་ཤེས་ཀྱི་ཁེ་ལ་སོང་།
en: Their hearts revolve around gain and public reputation.

source: །བྱང་ཆུབ་ཡོན་ཏན་བརྒྱས་ཁེབས་བོར་ནས་ནི།
en: Having abandoned enlightenment, which is replete with a hundred qualities,

source: །དེ་དག་འཐོབ་ཕྱིར་གཞན་གྱི་ཁྱིམ་ལ་དགའ།
en: They delight in frequenting others’ households for the sake of gain.

source: །ཁྭ་འདྲ་སྡང་བ་ཁྲེལ་དང་མོས་བློ་བྲལ།
en: “Like malicious crows, they are shameless and without devotion.

source: །ཤེས་ཀྱི་ཁེ་ཕྱིར་བདུད་ཀྱི་དབང་དུ་སོང་།
en: For the sake of public reputation, they have fallen under the power of Namuci.

source: །ཉོན་མོངས་རག་ལུས་སྲིད་པའི་འགྲོ་བར་གཞོལ།
en: Dependent on their afflictions, they drown in the realms of existence

source: །བདག་འདིར་ཡོན་ཏན་ལྡན་ཞེས་དེ་སྐད་སྨྲ།
en: And speak thus, ‘Here, we are endowed with good qualities!’

source: །ལུས་ནི་དགོན་པ་འདྲ་བའི་གྲོང་ཁྱེར་དུ།
en: “Their bodies are in the forest, but their minds dwell on the city.

source: །འཐོབ་ཕྱིར་དེ་དག་རྣམ་པར་རྟོག་པས་སྤྱོད།
en: They practice, but all the while their thoughts are set on procurements.

source: །གནམ་དང་ས་ལྟར་ཐར་ལས་རིང་བ་སྟེ།
en: They are as far away from liberation as the sky is from the earth.

source: །དེ་འདྲ་དེ་དག་སྦྲུལ་ལྟར་རིང་དུ་སྤང་།
en: Drive such people far away like snakes!

source: །དེ་དག་སངས་རྒྱས་ཆོས་དང་དེ་བཞིན་དུ།
en: “They delight in neither the Buddha, nor the Dharma,

source: །དགེ་འདུན་ཡོན་ཏན་བརྒྱས་གང་དགའ་མ་ཡིན།
en: Nor the Saṅgha, which is replete with a hundred qualities.

source: །མཐོ་རིས་བོར་ནས་ངན་པའི་ལམ་དུ་སོང་།
en: Abandoning the higher realms, they go down bad paths.

source: །སྡུག་པས་ཕོངས་ནས་སྲིད་པའི་འགྲོ་བར་འཁྱམས།
en: Bereft of happiness, they roam around in the realms of saṃsāra.

source: །ང་ཡི་སྤྱོད་པ་ཉེ་བར་བསྟན་པ་འདི་ཐོས་ནས།
en: “Upon hearing this teaching about my practice,

source: །ཡང་དག་ལྷག་པའི་བསམ་པའི་སྒྲུབ་པས་འདི་ལ་སྦྱོར།
en: Apply it now by accomplishing the perfect, lofty intent.

source: །བསྐལ་པ་བྱེ་བ་མང་པོས་རྙེད་དཀའ་དལ་རྙེད་ཀྱིས།
en: Seizing this opportunity, so hard to find during myriad eons,

source: །དེ་ལྟས་ཇི་སྐད་བསྟན་པའི་ཆོས་ཉིད་འདིར་བརྩོན་གྱིས།
en: You should apply yourself to the nature of reality, just as I have taught it here.

source: །གང་ཞིག་ཐེག་མཆོག་བྱང་ཆུབ་དམ་པ་འཚང་རྒྱར་འདོད།
en: “Those who wish to awaken to the excellent enlightenment of the supreme vehicle

source: །དེ་ཡིས་རྒྱལ་པོ་དེ་ཡི་ཡོན་ཏན་དྲན་པར་བྱ།
en: Should recall its qualities, O king!

source: །བསམས་ཏེ་ཡང་དག་ཇི་བཞིན་ཚུལ་བཞིན་གནས་པར་བྱ།
en: Reflecting thoroughly, they should abide in a proper way, according to how things are.

source: །དེ་ལྟས་བདེ་གཤེགས་རྣམས་ཀྱི་བྱང་ཆུབ་ཆགས་མེད་འགྲུབ།
en: The enlightenment of the sugatas is thereby accomplished without hindrance.

source: །ཡོན་ཏན་འདི་དག་རྟོགས་པས་འཕགས་པའི་རིགས་ལ་བསྟེན།
en: “Having realized these qualities, you should attend to noble families.

source: །རང་གིས་འདིར་ནི་ཀུན་ཏུ་ཤེས་པ་བསྐྱེད་པར་བྱ།
en: You should indeed generate wisdom here and now.

source: །བསྟན་པ་ཡོན་ཏན་སྙིང་པོ་འདི་འདྲ་མ་སྤོང་ཤིག །བྱིས་པ་ལྟ་བུར་འགྲོ་བ་ལྔར་ནི་འཁྱམས་ས་རེ།
en: Don’t abandon such a teaching, which has the essence of qualities, Or you will roam around in the five realms of existence like childish beings!

source: །འདིར་ནི་རི་དང་དགོན་པ་ཕུག་ཏུ་གནས་པར་བྱ།
en: “Live in mountains, forests, and caves, here and now!

source: །དེར་གནས་ནས་ནི་བདག་མི་སྙེམས་ཤིང་གཞན་མི་སྨད།
en: Dwelling there, you will neither exalt yourself nor despise others.

source: །སྔོན་ཆད་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱ་མཉེས་མ་བྱས། །རྗེས་སུ་དྲན་ནས་རྟག་པར་རྒྱུན་ཏུ་བདག་ལ་སྤྱོས།
en: Continually apply yourself at all times, Remembering that in former times, you did not please the myriad buddhas.

source: །ལུས་དང་སྲོག་ལ་སྲེད་པ་མ་ཆགས་སྤང་བར་བྱ།
en: “Abandon without attachment the craving for body and life!

source: །གུས་པ་དྲག་པོ་བསྐྱེད་ནས་ཆོས་ལ་བརྩོན་པར་གྱིས།
en: Generate deep respect and exert yourself in the Dharma!

source: །ང་ཡིས་མདོ་འདིར་སྒྲུབ་པ་བཤད་པ་འདིར་གནས་ན།
en: For those who abide by the practices I explained in this sūtra,

source: །དེ་དག་རྣམས་ཀྱི་ཕྱི་ནས་བྱང་ཆུབ་རྙེད་མི་དཀའ།
en: It will not be difficult to attain enlightenment.

source: །གང་དག་རྒྱལ་བའི་ཐེག་པ་འདི་ལ་དགའ་བརྩོན་པ།
en: “Those who practice will delight in the Victorious One’s vehicle.

source: །ཐོས་ནས་ཕྱིར་ཞིང་ཡིད་ནི་འཇུག་པར་བྱ་བའི་རིགས།
en: Those who do not practice will turn their minds away after having heard it.

source: །དེ་ལྟ་བས་ན་བསྟན་ལ་མོས་པ་བསྐྱེད་པར་བྱ།
en: Therefore, you should generate devotion toward the doctrine,

source: །རྣམ་པར་རྒྱུ་བའི་ཚེ་ན་ཕྱིས་འགྱོད་གྱུར་ཏ་རེ།
en: Lest you are filled with regret when you deviate in the future.

source: །ཡུལ་འཁོར་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་ལ་སྤྱོད་པ་ཡང་གང་ཞིག་བདག་འདི་ལ་བསླབ་པོ།
en: “Rāṣṭrapāla, suppose one bodhisattva engages in the five perfections, and the other diligently practices this Dharma discourse , thinking ‘I shall study this.

source: །བདག་སྡོམ་པ་འདི་ལ་གནས་པར་བྱའོ་སྙམ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ནན་ཏན་གྱིས་སྒྲུབ་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིའི་གན་ན་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ།
en: I shall abide by these vows.’ In that case, the amount of the first one’s merit would not come close to even a hundredth part of the latter’s.

source: སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་གྲངས་དང་ཆ་དང་བགྲང་བ་དང་དཔེ་དང་རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: It would not reach a thousandth, a hundred-thousandth, or a trillionth—it would not even be amenable to any counting, division, calculation, or comparison.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་སྔོན་སེམས་མ་བསྐྱེད་པའི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་སྐྱེ་དགུ་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: As the Bhagavān explained this Dharma discourse , all the accompanying thirty billion gods, humans, and asuras who had not previously given rise to the aspiration to enlightenment now gave rise to the mind intent on unsurpassable, perfectly complete enlightenment, without straying away from it.

source: །དགེ་སློང་བདུན་སྟོང་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: The minds of the seven thousand monks, no longer grasping, were completely liberated from contaminants.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the venerable Rāṣṭrapāla asked this of the Bhagavān:

source: །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: “Bhagavān, what is the name of this Dharma discourse

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཡུལ་འཁོར་སྐྱོང་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དམ་བཅས་པ་དོན་ཡོད་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །སྐྱེས་བུ་དམ་པ་རྣམ་པར་རོལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་ངེས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །དོན་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: How should I remember it?” Having thus been asked, the Bhagavān replied to the venerable Rāṣṭrapāla, “In this regard, Rāṣṭrapāla, you should remember this Dharma discourse as The Pure, Meaningful Promise . You should remember it as The Sport of Noble Men and The Ascertainment of the Conduct of a Bodhisattva

source: ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: And you should also remember it as The Perfect Fulfillment of Meaning .” After the Bhagavān had spoken these words, the venerable Rāṣṭrapāla, as well as the world with its gods, humans, asuras, and gandharvas, rejoiced and praised what the Bhagavān had said.

source: །འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་ཡུལ་འཁོར་སྐྱོང་གིས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅྭ་བརྒྱད་པ་རྫོགས་སོ།།
en: This concludes The Questions of Rāṣṭrapāla (1), the eighteenth of the one hundred thousand sections of the Dharma discourse known as The Noble Great Heap of Jewels.

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། མུ་ནི་ཝརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།
en: Translated, edited, corrected according to the revised terminology, and finalized by the Indian scholars Jinamitra, Dānaśīla, and Munivarman, along with the chief editor and translator monk Bandé Yeshé Dé.
